# Επίλυση Δραστηριοτήτων του μαθήματος Προγραμματισμός Υπολογιστών
# Γ' ΕΠΑΛ
# ΤΟΜΕΑΣ ΠΛΗΡΟΦΟΡΙΚΗΣ
# worked with Python 2.7.10
# @TasosChatz


'''

ΚΕΦΑΛΑΙΟ 5ο ΚΛΑΣΣΙΚΟΙ ΑΛΓΟΡΙΘΜΟΙ
Δραστηριότητα 9 / σελίδα 89
Να γράψετε μια συνάρτηση σε Python η οποία διαβάζει αριθμούς από το χρήστη
τους οποίους τοποθετεί σε μια λίστα σε φθίνουσα σειρά, την οποία και επιστρέφει.
Κάθε φορά που διαβάζει έναν νέο αριθμό τον τοποθετεί στη σωστή θέση στην ήδη
ταξινομημένη λίστα, ώστε να διατηρείται η φθίνουσα διάταξη των στοιχείων 
της λίστας. Ποιον αλγόριθμο ταξινόμησης σας θυμίζει η παραπάνω λειτουργία; 
Σε τι διαφέρει η συνάρτηση που θα αναπτύξετε από τον αλγόριθμο αυτόν;   
  
'''

# Αλγόριθμος ταξινόμησης με εισαγωγή
def insertionSort( aList ) :
    for i in range(1, len( aList ) ) :
        value = aList[i]
        j = i
        while j > 0 and aList[j-1] < value :
            aList[j] = aList[j-1]
            j = j-1
            aList[j] = value

# Εισαγωγή στοιχείων, κλήση συνάρτησης ταξινόμησης
aList = []
item = input('Δώσε ένα νέο ακέραιο=')
while item != None :
    aList.append(item)
    insertionSort(aList)
    print aList
    item = input('Δώσε ένα νέο ακέραιο (None to stop)=')


