# Επίλυση Δραστηριοτήτων του μαθήματος Προγραμματισμός Υπολογιστών
# Γ' ΕΠΑΛ
# ΤΟΜΕΑΣ ΠΛΗΡΟΦΟΡΙΚΗΣ
# worked with Python 2.7.10
# @ Tasos Chatzipapadopoulos

'''

ΚΕΦΑΛΑΙΟ 5ο ΚΛΑΣΣΙΚΟΙ ΑΛΓΟΡΙΘΜΟΙ
Δραστηριότητα 8 / σελίδα 89
Το πρόβλημα της ολλανδικής σημαίας αναφέρεται στην αναδιάταξη μιας λίστας
γραμμάτων, η οποία περιέχει μόνο τους χαρακτήρες R, W, B. (Red, White, Blue),
έτσι ώστε όλα τα R να βρίσκονται πριν από τα W και όλα τα W να βρίσκονται πριν
από B. Να τροποποιήσετε έναν από τους αλγορίθμους ταξινόμησης που παρουσι-
άστηκαν σε αυτήν την ενότητα, ώστε να επιλύει αυτό το πρόβλημα.      

'''

# Συνάρτηση Υλοποίησης αλγορίθμου Dutch Flag Problem
def orderFlagColors(aList):
        i, j, n = 0, 0, len(aList) - 1
        
        while j <= n:
            if aList[j] < 1:
                aList[i], aList[j] = aList[j], aList[i]
                i += 1
                j += 1
            elif aList[j] > 1:
                aList[j], aList[n] = aList[n], aList[j]
                n -= 1
            else:
                j += 1
                
